app/Controllers/Home.php

SELECT *
FROM `obce_okres`
WHERE `kraj` = 141
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `obce_okres`
WHERE `kraj` = 141
---
    public function __construct($perPage = 20)
    {
        $this->obec = new Obec();
        $this->okres = new Okres();
        $this->kraj = new Kraj();

        $this->data["okres"] = $this->okres->where("kraj",141)->paginate($perPage);

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `obce_obec`.`nazev`, Count(*) as pocet
FROM `obce_obec`
INNER JOIN `obce_cast_obce` ON `obce_obec`.`kod` = `obce_cast_obce`.`obec`
INNER JOIN `obce_ulice` ON `obce_ulice`.`cast_obce` = `obce_cast_obce`.`kod`
INNER JOIN `obce_adresni_misto` ON `obce_adresni_misto`.`ulice` = `obce_ulice`.`kod`
JOIN `obce_okres` ON `obce_okres`.`kod` = `obce_obec`.`okres`
GROUP BY `obce_obec`.`kod`
) CI_count_all_results
SELECT `obce_obec`.`nazev`, Count(*) as pocet
FROM `obce_obec`
INNER JOIN `obce_cast_obce` ON `obce_obec`.`kod` = `obce_cast_obce`.`obec`
INNER JOIN `obce_ulice` ON `obce_ulice`.`cast_obce` = `obce_cast_obce`.`kod`
INNER JOIN `obce_adresni_misto` ON `obce_adresni_misto`.`ulice` = `obce_ulice`.`kod`
JOIN `obce_okres` ON `obce_okres`.`kod` = `obce_obec`.`okres`
GROUP BY `obce_obec`.`kod`
ORDER BY `pocet` DESC
 LIMIT 20
---
    public function index(): string
    {

        $this->data['page_title'] = "Home";
        $this->data['obec'] = $this->obec->select("obec.nazev, Count(*) as pocet")->join("cast_obce", "obec.kod = cast_obce.obec", "inner")->join("ulice", "ulice.cast_obce = cast_obce.kod", "inner")->join("adresni_misto", "adresni_misto.ulice = ulice.kod", "inner")->join("okres", "okres.kod = obec.okres")->groupBy("obec.kod")->orderBy("pocet", "desc")->paginate(20);

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `obce_obec`.`nazev`, count(*) as pocet
FROM `obce_obec`
INNER JOIN `obce_cast_obce` ON `obce_obec`.`kod` = `obce_cast_obce`.`obec`
INNER JOIN `obce_ulice` ON `obce_ulice`.`cast_obce` = `obce_cast_obce`.`kod`
INNER JOIN `obce_adresni_misto` ON `obce_adresni_misto`.`ulice` = `obce_ulice`.`kod`
JOIN `obce_okres` ON `obce_okres`.`kod` = `obce_obec`.`okres`
WHERE `obce_okres`.`kod` = '3708'
GROUP BY `obce_obec`.`kod`
) CI_count_all_results
---
    public function okres($kod, $perPage = 20)
    {

        $this->data["obec"] = $this->obec->select(select:"obec.nazev, count(*) as pocet ")->
        join("cast_obce", "obec.kod = cast_obce.obec","inner")->
        join("ulice", "ulice.cast_obce = cast_obce.kod","inner")->join